Repository: UlricusR/iOS-EasyFPU
Catalog: EasyFPU/Resources/*.lproj/Localizable.strings
Languages: de

source: Disclaimer
de: Haftungsausschluss

source: Applying the nutrition information calculated by this app in a diabetes therapy may bear the risk of high or low blood glucose values. By accepting this disclaimer, you confirm that you have understood the interaction of EasyFPU and Loop via Apple Health, which is in detail documented on the author's website. You also acknowledge you use this app at your own risk!
de: Die Anwendung der von dieser App berechneten Ernährungsdaten im Rahmen einer Insulintherapie kann zu hohen oder niedrigen Blutzuckerwerten führen. Durch Akzeptieren dieses Haftungsausschlusses bestätigst Du, dass Du die Interaktion von EasyFPE mit Loop via Apple Health verstanden hast, nachzulesen auf der Webseite der Autors. Du bestätigst ebenfalls die Anwendung dieser App auf eigene Gefahr!

source: Please consult your medical doctor before modifying your diabetes therapy and applying Fat Protein Units.
de: Bitte konsultiere Deinen Diabetologen, bevor Du Deine Insulintherapie anpasst und mit Fett-Protein-Einheiten arbeitest.

# Read more here!
source: Read more on the website of the author!
de: Mehr über die Hintergründe auf der Webseite des Autors!

source: Declining will not let you continue to use the app.
de: Bei Ablehnung wirst Du die App nicht weiter nutzen können.

source: You need to accept the disclaimer to continue.
de: Du musst dem Haftungsausschluss zustimmen, um fortfahren zu können.

source: Accept
de: Zustimmen

source: Decline
de: Ablehnen

source: Done
de: Fertig

source: Finished
de: Fertig

source: Cancel
de: Abbrechen

source: Add
de: Hinzufügen

source: Update
de: Aktualisieren

source: Search
de: Suchen

source: Edit
de: Bearbeiten

source: Duplicate
de: Duplizieren

source: Share
de: Teilen

source: Clear
de: Zurücksetzen

source: Close
de: Schließen

# Move to Product List
source: Move to Dishes
de: Zu Speisen verschieben

# Move to Ingredient List
source: Move to Ingredients
de: Zu Zutaten verschieben

source: Delete
de: Löschen

source: Do not delete
de: Nicht löschen

source: Copy
de: Kopie

source: Tap to edit
de: Zum Bearbeiten antippen, zum Löschen wischen

source: - Copy
de: - Kopie

source: Error
de: Fehler

source: Warning
de: Warnung

source: Notice
de: Hinweis

source: Success
de: Erfolg

source: Fatal Error
de: Fataler Fehler

source: This should not have happened, please inform the developer team.
de: Das hätte nicht passieren dürfen. Bitte das Entwicklerteam informieren.

source: Cannot store parameter:
de: Kann Parameter nicht speichern:

source: About
de: Über

source: About this app
de: Über diese App

source: An iOS app - mainly for Type 1 Diabetes patients - to ease the calculation of sugars, regular carbs, extended carbs from fat-protein-units (FPUs) and their matching absorption times - synchronized across all your iOS devices via iCloud (optional).
de: Eine iOS-App - hauptsächlich für Typ 1-Diabetiker - zum einfachen Berechnen von Kohlenhydraten aus Zucker, regulären Kohlenhydraten und Fett-Protein-Einheiten (FPE) bzw. verzögerten Kohlenhydraten (auch bekannt als e-Carbs oder Fake Carbs) - synchronisiert zwischen allen Deinen iOS-Geräten via iCloud (optional).

source: It's free and open-source, so I'll never ask you for money.
de: Sie kostet nichts und ist Open-Source.

source: Documentation on rueth.info
de: Dokumentation auf rueth.info

# Home-Link
source: https://www.rueth.info/iOS-EasyFPU/en/
de: https://www.rueth.info/iOS-EasyFPU/de/

source: Calculate meal
de: Mahlzeit berechnen

# Total meal
source: My meal
de: Meine Mahlzeit

source: This is where you will see the nutritial data of your meal and where you can export it to Loop.
de: Hier werden die Nährwertangaben Deiner Mahlzeit erscheinen, die Du dann nach Loop exportieren kannst.

# Add products to your meal
source: Add dishes to your meal
de: Füge Speisen zur Mahlzeit hinzu

# Add products
source: Add dishes
de: Speisen hinzufügen

# Edit products
source: Edit dishes
de: Speisen bearbeiten

# Products
source: Dishes
de: Speisen

# My Products
source: My Dishes
de: Meine Speisen

# Product
source: Dish
de: Speise

source: Oops! There are no dishes in your list yet. Start by adding some!
de: Hoppla! Es sind noch keine Speisen auf Deiner Liste. Füge welche hinzu!

source: Favorite
de: Lieblingsessen

source: Carbs per 100g
de: Kohlenhydrate pro 100g

source: Calories per 100g
de: Kalorien pro 100g

source: g Carbs
de: g Kohlenhydrate

source: g Regular Carbs
de: g reguläre KH

source: g Sugars
de: g Zucker

source: Carbs
de: KH

source: Sugars
de: Zucker-KH

# g Extended Carbs
source: g e-Carbs
de: g verl. KH

source: Thereof Sugars per 100g
de: Davon Zucker pro 100g

source: Extended Carbs
de: Verlängerte Kohlenhydrate

source: g/FPU
de: g/FPE

# New Product
source: New Dish
de: Neue Speise

# Edit food item
source: Edit Dish
de: Essen bearbeiten

# Nutritional values per 100g:
source: Per 100g:
de: Pro 100g:

source: Nutritional values for
de: Nährwerte für

source: Amount
de: Menge

source: Amount consumed
de: Gegessene Menge

source: Amount used
de: Verwendete Menge

source: h Absorption Time
de: h Absorptionszeit

source: Absorption Time
de: Absorptionszeit

source: Total nutritional values
de: Gesamt-Nährwerte

source: Typical amount
de: Typische Menge

source: Typical amounts:
de: Typische Mengen:

source: Add to typical amounts
de: Zu typischen Mengen hinzufügen

source: Could not identify typical amount.
de: Konnte typische Menge nicht identifizieren.

source: Comment
de: Kommentar

source: As sold
de: Wie verkauft

source: Initial source
de: Ursprüngliche Quelle

source: Enter amount consumed or select typical amount
de: Gegessene Menge eingeben oder typische Menge auswählen

source: Enter amount used or select typical amount
de: Verwendete Menge eingeben oder typische Menge auswählen

source: Enter amount consumed
de: Gegessene Menge eingeben

source: Enter amount used
de: Verwendete Menge eingeben

source: Select amount
de: Menge auswählen

source: Cannot delete food item
de: Kann Essen nicht löschen

source: Delay of Extended Carbs
de: Verzögerung der verlängerten KH

source: Cannot delete ingredient
de: Kann Zutat nicht löschen

source: Could not generate data export
de: Konnte Daten nicht exportieren

# is not a valid data model
source: is not a valid data model. Could not import data.
de: ist kein gültiges Datenmodell. Konnte Daten nicht importieren.

source: This food item is created from a recipe, please open it in the recipe editor
de: Dieses Essen ist mit einem Rezept verknüpft, bitte öffne es im Rezepteditor

source: There's an associated recipe, do you want to delete it as well?
de: Es gibt ein verknüpftes Rezept. Willst Du dieses auch löschen?

# Keep recipe
source: Delete dish only
de: Nur Speise löschen

source: Edit food
de: Essen bearbeiten

source: Delete food
de: Essen löschen

source: Do you really want to delete this food item? This cannot be undone!
de: Willst Du dieses Essen wirklich löschen? Dies kann nicht rückgängig gemacht werden!

source: Cannot delete food
de: Kann Essen nicht löschen

# This food item is in use in a recipe
source: This food item is in use in the following recipes, please remove it before deleting:
de: Diese Zutat wird in folgenden Rezepten verwendet, bitte vor dem Löschen dort entfernen:

source: Ingredients
de: Zutaten

source: My Ingredients
de: Meine Zutaten

source: Ingredient
de: Zutat

source: Oops! There are no ingredients in your list yet. Start by adding some!
de: Hoppla! Es sind noch keine Zutaten auf Deiner Liste. Füge welche hinzu!

source: Ingredient List
de: Zutatenliste

source: New Ingredient
de: Neue Zutat

source: Category
de: Kategorie

# Composed product
source: My recipe
de: Mein Rezept

source: Weight
de: Gewicht

# Final product
source: My recipe
de: Mein Rezept

# The weight of the composed product is less than the sum of its ingredients
source: The weight of the finished dish is less than the sum of its ingredients
de: Das Gewicht der Speise is kleiner als das seiner Zutaten

# The weight of the composed product is more than the sum of its ingredients
source: The weight of the finished dish is more than the sum of its ingredients
de: Das Gewicht der Speise is größer als das seiner Zutaten

source: Save
de: Speichern

source: Save anyway
de: Trotzdem speichern

source: Number of portions
de: Anzahl Portionen

source: If the number of portions is set to 0, no typical amounts will be created.
de: Wenn die Anzahl Portionen auf 0 gesetzt ist, werden keine typischen Mengen generiert.

source: Generate
de: Berechnen

# portion(s)
source: portions(s)
de: Portion(en)

source: per portion
de: pro Portion

source: Cannot create typical amount:
de: Kann typische Menge nicht berechnen:

# successfully saved in Products
source: successfully saved as Recipe and added to Dishes
de: erfolgreich als Rezept und in Speisen gespeichert

# successfully saved as Recipe
source: successfully saved as Recipe, but not added to Dishes
de: erfolgreich als Rezept gespeichert, aber nicht als Speise

# successfully updated in Products
source: successfully updated as Recipe and in Dishes
de: erfolgreich als Rezept und Speise aktualisiert

# successfully updated as Recipe
source: successfully updated as Recipe, but not in Dishes
de: erfolgreich als Rezept (aber nicht als Speise) aktualisiert

# Could not create the composed food item
source: Oops! Could not create the composed food item due to missing ingredients.
de: Hoppla! Das zusammengestellte Essen konnte wegen fehlender Zutaten nicht gespeichert werden.

# Could not update the composed food item
source: Oops! Could not update the composed food item, as no Recipe was found.
de: Hoppla! Das zusammengestellte Essen konnte nicht aktualisiert werden wegen eines fehlenden Rezepts.

# Associated Ingredients
source: Associated Recipes
de: Verknüpfte Rezepte

# This food item is used as ingredient in the following recipes:
source: This ingredient is used in the following recipes:
de: Diese Zutat wird in folgenden Rezepten genutzt:

# Updating the food item will also update the associated recipes.
source: Updating the ingredient will change the nutritional values of these recipes.
de: Die Aktualisierung der Zutat verändert die Nährwerte dieser Rezepte.

source: Update recipes
de: Trotzdem speichern

source: Eat
de: Essen

source: e-Carbs
de: Verlängerte KH

source: Regular Carbs
de: Reguläre KH

source: How much?
de: Wieviel?

source: When?
de: Wann?

source: How long?
de: Wie lange?

source: min at
de: min um

source: min for
de: min für

source: For
de: Für

source: FPU
de: FPE

source: Further details
de: Mehr Details

source: Export to Apple Health
de: Nach Apple Health exportieren

source: Carbs:
de: Kohlenhydrate:

source: Calories:
de: Kalorien:

source: Amount:
de: Menge:

# Quantity
source: Quantity as sold
de: Verkaufsmenge

source: Data alert
de: Eingabefehler

source: Name must not be empty
de: Name darf nicht leer sein

source: Calories not a valid number or negative
de: Kalorien sind keine gültige Zahl oder negativ

source: Carbs not a valid number or negative
de: Kohlenhydrate sind keine gültige Zahl oder negativ

source: Calories from carbs (4 kcal per gram) exceed total calories
de: Kalorien aus Kohlenhydraten (ca. 4 kcal pro Gramm) übersteigen Gesamtkalorien

source: Amount not a valid number or negative
de: Menge keine gültige Zahl oder negativ

source: Value not a number
de: Ungültiger Wert

source: Value must not be negative
de: Wert darf nicht negativ sein

source: Value must not be zero or negative
de: Wert darf nicht negativ oder null sein

source: Delete food item
de: Dieses Essen löschen

source: Sugars exceed carbs
de: Zucker übersteigt Kohlenhydrate

source: Thereof
de: Davon

source: Search term must not be empty
de: Suchbegriff darf nicht leer sein

source: - new
de: - neu

# A food item with this name already exists
source: An entry with this name already exists
de: Ein Eintrag mit diesem Namen existiert bereits

source: Recipe List
de: Rezeptliste

# Cook
source: Cook & Bake
de: Kochen & Backen

# Recipes
source: My recipes
de: Meine Rezepte

source: Oops! No recipe yet! Then let's go!
de: Hoppla! Noch kein Rezept vorhanden! Dann aber ran!

source: Start cooking or baking
de: Jetzt kochen oder backen

source: Your yummy recipe will appear here once you add some ingredients.
de: Dein leckeres Rezept wird hier erscheinen, sobald Du Zutaten hinzufügst.

source: Have you added ingredients to 'My Ingredients'?
de: Hast Du Zutaten zu 'Meine Zutaten' hinzugefügt?

source: Add ingredients
de: Zutaten hinzufügen

source: Edit ingredients
de: Zutaten bearbeiten

# No associated cdComposedFoodItem
source: No associated cdComposedFoodItem - should not happen - please contact the app developer
de: Kein assoziiertes cdComposedFoodItem - das sollte nicht passieren - bitte das Entwicklungsteam informieren

# There's an associated product, do you want to delete it as well?
source: There's an associated dish, do you want to delete it as well?
de: Dieses Rezept ist mit einer Speise verknüpft. Willst Du diese auch löschen?

# Delete both
source: Delete recipe and dish
de: Rezept und Speise löschen

# Keep product
source: Delete recipe only
de: Nur Rezept löschen

source: Delete recipe
de: Rezept löschen

source: Do you really want to delete this recipe? This cannot be undone!
de: Willst Du dieses Rezept wirklich löschen? Dies kann nicht rückgängig gemacht werden!

source: Absorption scheme
de: Absorptionsschema

source: Absorption Blocks
de: Absorptionsblöcke

source: Tap to edit, swipe left to delete
de: Zum Bearbeiten antippen, zum Löschen nach links wischen

source: New absorption block:
de: Neuer Absorptionsblock:

source: Edit absorption block:
de: Absorptionsblock bearbeiten:

source: Absorption blocks:
de: Absorptionsblöcke:

source: Max. FPUs
de: Max. FPE

source: Absorption time
de: Absorptionszeit

source: FPU -
de: FPE -

source: Cannot find absorption block:
de: Kann Absorptionsblock nicht finden:

source: Maximum FPU value already exists
de: Maximaler FPE-Wert existiert bereits

source: Absorption time is equals or larger than the one of the following absorption block
de: Absorptionszeit is gleich oder größer als die des nachfolgenden Absorptionsblocks

source: Absorption time is equals or less than the one of the block before
de: Absorptionszeit ist gleich oder kleiner als die des vorherigen Blocks

source: Absorption time must be between previous and following block
de: Absorptionszeit muss zwischen vorherigem und nachfolgendem Block liegen

source: At least one absorption block required
de: Mindestens ein Absorptionsblock benötigt

source: Cannot determine absorption block index.
de: Kann Absorptionsblock-Index nicht festlegen.

source: Fatal error: Cannot convert numbers into string, please contact app developer
de: Fataler Fehler: Kann Zahlen nicht in String umwandeln, bitte informiere das Entwicklungsteam

source: Fatal error: Couldn't find CoreData FoodItem, please inform the app developer
de: Fataler Fehler: Konnte das CoreData FoodItem nicht finden, bitte informiere das Entwicklungsteam

source: Absorption block index out of range.
de: Absorptionsblock-Index außerhalb des gültigen Bereichs.

source: Reset to default
de: Auf Voreinstellungen zurücksetzen

source: Absorption Time Parameters for Sugars
de: Absorptionsparameter für Zucker-KH

source: Absorption Time Parameters for Carbs
de: Absorptionsparameter für reguläre KH

source: Absorption Time Parameters for e-Carbs
de: Absorptionsparameter für verlängerte KH

source: Delay
de: Verzögerung

source: Duration
de: Dauer

source: Interval
de: Intervall

source: Treat sugars separately
de: KH aus Zucker separat behandeln

source: Alert duration between exports
de: Hinweis-Dauer zwischen Exporten

source: Country
de: Land

source: Select food database country
de: Land für Lebensmitteldatenbank wählen

source: Select country
de: Land auswählen

source: Search worldwide
de: Weltweit suchen

source: App Settings
de: App-Einstellungen

source: Therapy Settings
de: Therapieeinstellungen

source: Settings
de: Einstellungen

# Import from JSON
source: Import (format: JSON)
de: Importieren (Format: JSON)

# Export to JSON
source: Export (format: JSON)
de: Exportieren (Format: JSON)

source: Successfully exported food list to:
de: Alle Essensdaten erfolgreich exportiert nach:

source: Failed to export food list to:
de: Konnte Essensliste nicht exportieren nach:

source: Failed to access
de: Zugriff nicht möglich auf

source: Successfully imported food list
de: Essensliste erfolgreich importiert

# Failed to import food list
source: Oops! Failed to import food list.
de: Hoppla! Konnte die Essensliste nicht importieren.

# Import food list
source: There's already food in the database.
de: Es ist bereits Essen in der Datenbank.

# Please select
source: Should the imported food replace it or be added to it?
de: Soll das importierte Essen dieses ersetzen oder hinzugefügt werden?

source: Replace
de: Ersetzen

# Append
source: Add
de: Hinzufügen

source: Keep both
de: Beide behalten

source: Create Food Item
de: Essen erstellen

# Only update Composed Food Item
source: Only update Recipe
de: Nur das Rezept aktualisieren

source: Unable to open URL:
de: Kann folgende URL nicht öffnen:

source: Failed to decode due to missing key
de: Konnte nicht entschlüsseln wegen fehlendem Schlüssel

source: Failed to decode due to type mismatch -
de: Konnte nicht entschlüsseln wegen Typfehler -

source: Failed to decode due to missing value -
de: Konnte nicht entschlüsseln wegen fehlendem Wert -

source: Failed to decode because it appears to be invalid JSON
de: Ungültige JSON-Datei

source: Failed to decode -
de: Konnte nicht entschlüsseln -

source: Help on the Web
de: Hilfe im Web

source: Could not identify absorption block
de: Konnte Absorptionsblock nicht identifizieren.

source: Cannot write data: HealthKit seem not to be available on your device.
de: Kann keine Daten schreiben: HealthKit scheint auf Deinem Gerät nicht zur Verfügung zu stehen.

source: Cannot save data to Health:
de: Kann keine Daten in Health schreiben:

source: Unspecified error
de: Unspezifischer Fehler

source: Cannot save data to Health: Please authorize EasyFPU to write to Health in your Settings.
de: Kann keine Daten in Health schreiben: Bitte gib EasyFPE in den Einstellungen die Berechtigung, in Health zu schreiben.

source: Successfully exported data to Health
de: Daten wurden erfolgreich nach Health exportiert

# Export to Health
source: Export to Apple Health
de: Apple Health-Export

source: Export
de: Exportieren

source: Error requesting authorization to write to Health:
de: Fehler beim Anfordern der Berechtigung, in Health zu schreiben:

source: Please choose the data to export:
de: Bitte wähle die zu exportierenden Daten:

source: Total Meal Carbs
de: Kohlenhydrate Gesamtmahlzeit

source: Total Meal Calories
de: Kalorien Gesamtmahlzeit

source: Please select at least one entry to export
de: Bitte mindestens einen Eintrag zum Export auswählen

source: Absorption Scheme has no Absorption Blocks
de: Absorptionsschema hat keine Absorptionsblöcke

# Preview of exported carbs in g
source: Preview of exported carbs
de: Vorschau der exportierten Kohlenhydrate

# Delay until meal
source: Meal starts in
de: Mahlzeit beginnt in

# LastSugarsExport
source: sugars
de: Zucker

# LastCarbsExport
source: carbs
de: reguläre Kohlenhydrate

# LastECarbsExport
source: e-carbs
de: verlängerte Kohlenhydrate

# LastCaloriesExport
source: calories
de: Kalorien

source: You have exported the following data less than
de: Du hast folgende Daten vor weniger als

source: minutes ago:
de: Minuten exportiert:

source: Export anyway
de: Trotzdem exportieren

# NSFaceIDUsageDescription
source: Avoid accidential export of carbs and/or calories to Apple Health
de: Vermeidung von versehentlichem Export von Kohlenhydraten und/oder Kalorien nach Apple Health

source: Authentication error, nothing was exported
de: Authentifizierungsfehler, kein Export möglich

# Sugars_short
source: Sugars
de: Zucker

# Carbs_short
source: Regular
de: Reguläre

# eCarbs_short
source: Extended
de: Verlängerte

source: Carbs in g
de: Kohlenhydrate in g

# Choose exported data
source: Exported data
de: Exportierte Daten

# Set meal delay
source: Meal delay
de: Startzeitpunkt der Mahlzeit

source: Data export preview
de: Datenexport-Vorschau

source: Food Database
de: Lebensmitteldatenbank

source: Database
de: Datenbank

source: No product found
de: Keine Speise gefunden

source: No products found
de: Keine Speisen gefunden

source: No nutriments found
de: Keine Nährwerte gefunden

source: Entry has no name
de: Eintrag hat keinen Namen

source: Entry has no code
de: Eintrag hat keinen Code

source: Entry has no calories per 100g
de: Eintrag hat keine Kalorien pro 100g

source: Entry has no carbs per 100g
de: Eintrag hat keine Kohlenhydrate pro 100g

source: Food Database Search
de: Datenbank-Suche

source: Select
de: Übernehmen

source: No search results (yet)
de: (Noch) keine Suchergebnisse

source: Nothing selected
de: Nichts ausgewählt

source: - No name -
de: - Kein Name -

source: Error scanning food:
de: Fehler beim Scannen:

source: Loading food item...
de: Lade Lebensmittel...

# Scanned Food
source: Found Food
de: Gefundenes Produkt

source: No food found
de: Kein Lebensmittel gefunden

source: Cannot decode JSON
de: Kann JSON nicht decodieren

source: Unable to create image url from
de: Kann URL nicht bilden:

source: No image data found
de: Kein Bilddateien gefunden

source: Incomplete data:
de: Unvollständige Daten:

source: Decoding error:
de: Decodierungsfehler:

source: No search results:
de: Keine Suchergebnisse:

source: Network error:
de: Netzwerkfehler:

source: Input error:
de: Eingabefehler:

source: Link to entry in
de: Link zum Eintrag in

source: No food selected
de: Kein Lebensmittel ausgewählt

source: Searching
de: Suche

source: The author of the app is not liable for the correctness of the nutritional values in the database. Please cross-check those! Use at your own risk!
de: Der Autor der App übernimmt keine Haftung für die Korrektheit der Nährwerte in der Datenbank. Bitte kontrolliere diese! Nutzung auf eigenes Risiko!

# Accept and continue
source: Use at own risk
de: Auf eigenes Risiko nutzen

source: Decline and cancel
de: Ablehnen und abbrechen

source: Generate Typical Amounts
de: Typische Mengen erzeugen

source: Cannot find JSON content. Please contact the app developer.
de: Kann JSON-Inhelt nicht finden. Bitte benachtige das Entwicklerteam.

source: Menu bar
de: Menüleiste

# Product Maintenance List
source: Maintain Dishes
de: Speisenliste

# Ingredient Maintenance List
source: Maintain Ingredients
de: Zutatenliste

source: Here you maintain your dishes or ingredients.
de: Hier pflegst Du Deine Speisen oder Zutaten.

source: A frying pan symbol indicates that the food item is associated to a recipe.
de: Ein Bratpfannensymbol weist darauf hin, dass das Essen mit einem Rezept verknüpft ist.

source: Adds a new dish or ingredient to the list.
de: Fügt eine neue Speise oder Zutat hinzu.

source: Filters by favorite dishes or ingredients.
de: Filtert nach Lieblingsspeisen.

source: To edit, duplicate, share, move or delete a dish or ingredient, swipe left or right.
de: Zum Bearbeiten, Duplizieren, Teilen, Bewegen oder Löschen nach rechts oder links wischen.

# Product Selection List
source: Choose Dishes
de: Speisen auswählen
