Repository: UlricusR/iOS-EasyFPU
Catalog: EasyFPU/Resources/*.lproj/Localizable.strings
Languages: de

source: The list of dishes contains all dishes available to compose a meal. Here you select which dishes to include in your meal. If the list is empty, you need to first add dishes.
de: Die Speisenliste enthält alle zur Zusammenstellung einer Mahlzeits verfügbaren Speisen. Hier wählst Du, welche Speisen Du in Deine Mahlzeit aufnehmen möchtest. Wenn die Liste leer ist, musst Du zunächst Speisen hinzufügen.

source: As soon as your list of dishes contains one or more dishes, you can go ahead and create a meal. To do so, tap once on the respective dish. This will open the screen to select the amount.
de: Sobald Deine Speisenliste eine oder mehrere Speisen enthält, kannst Du eine Mahlzeit erstellen. Tippe dazu einmal auf die jeweilige Speise. Dadurch wird die Ansicht zur Auswahl der Menge geöffnet.

# Indicates that the dish is available for being added to your meal.
source: Indicates that the dish is available for being added to your meal by tapping it.
de: Zeigt an, dass die Speise durch Antippen zur Mahlzeit hinzugefügt werden kann.

source: Indicates that the dish has been selected and is included in your meal. Tapping it again will remove it from your meal.
de: Zeigt an, dass die Speise ausgewählt wurde und in der Mahlzeit enthalten ist. Tippe erneut darauf, um sie aus der Mahlzeit zu entfernen.

source: Add a new dish to the list. This is not selecting it, this needs to be done separately.
de: Fügt der Liste eine neu Speise hinzu. Die Speise wird dadurch nicht der Mahlzeit hinzugefügt, dies muss separat erfolgen.

# The red X at the top of the screen lets you remove all selected dishes at once.
source: Removes all selected dishes at once.
de: Entfernt alle ausgewählten Speisen auf einmal.

source: Filters by your favorite dishes.
de: Filtert nach Deinen Lieblingsspeisen.

# Ingredient Selection List
source: Choose Ingredients
de: Zutaten auswählen

source: The ingredients list contains all ingredients available to compose a recipe. Here you select which ingredients to include in your recipe. If the list is empty, you need to first add ingredients.
de: Die Zutatenliste enthält alle zur Zusammenstellung eines Rezepts verfügbaren Zutaten. Hier wählst Du, welche Zutaten Du in Dein Rezept aufnehmen möchtest. Wenn die Liste leer ist, musst Du zunächst Zutaten hinzufügen.

source: As soon as your ingredients list contains one or more ingredients, you can go ahead and create a recipe. To do so, tap once on the respective ingredient. This will open the screen to select the amount.
de: Sobald Deine Zutatenliste eine oder mehrere Zutaten enthält, kannst Du ein Rezept erstellen. Tippe dazu einmal auf die jeweilige Zutat. Dadurch wird die Ansicht zur Auswahl der Menge geöffnet.

source: Adds new ingredients to the list. This is not selecting it, this needs to be done separately.
de: Fügt der Liste neue Zutaten hinzu. Die Zutat wird dadurch nicht dem Rezept hinzugefügt, dies muss separat erfolgen.

# Indicates that the ingredient is available for being added to your recipe.
source: Indicates that the ingredient is available for being added to your recipe by tapping it.
de: Zeigt an, dass die Zutat durch Antippen zum Rezept hinzugefügt werden kann.

source: Indicates that the ingredient has been selected and is included in your recipe. Tapping it again will remove it from your recipe.
de: Zeigt an, dass die Zutat ausgewählt wurde und im Rezept enthalten ist. Tippe erneut darauf, um sie aus dem Rezept zu entfernen.

source: The red X at the top of the screen lets you remove all selected ingredients at once.
de: Mit dem roten X oben auf dem Bildschirm kannst Du alle ausgewählten Zutaten auf einmal entfernen.

# Select Food Item
source: Enter amount
de: Menge eingeben

source: You may enter the consumed amount in three different ways.
de: Es gibt drei Wege, die gegessene bzw. benötigte Menge einzugeben:

source: 1. You directly enter it in the text field.
de: 1. Gib die gegessene Menge direkt ins entsprechende Textfeld ein.

source: 2. You use the green number fields to add to the amount already displayed in the text field.
de: 2. Nutze die grünen Zahlenfelder, um die darauf abgebildete Menge der existierenden Menge hinzuzufügen.

source: 3. In case you have stored typical values for the food item, you tap on one of those typical amounts. This will overwrite any existing value.
de: 3. Solltest Du bereits typische Mengen für das Essen angelegt haben, kannst Du diese aus der angezeigten Liste auswählen. Diese Auswahl überschreibt die aktuell angezeigte Menge.

source: You may also add a new typical amount by clicking 'Add to typical amounts'. This will take over the currently active amount from the text field and ask you for a comment.
de: Du kannst die aktuell angezeigte Menge auch als neue typische Menge abspeichern, indem Du 'Zu typischen Mengen hinzufügen' antippst. Du wirst dann um einen Kommentar zu dieser Menge gebeten.

source: Saves the typical amount.
de: Speichert die typische Menge.

source: Use the food item editor to maintain existing typical amounts.
de: Um existierende typische Mengen zu bearbeiten, nutze bitte den Dialog zum Bearbeiten eines Essens.

source: Edit Food Item
de: Essen bearbeiten

source: This dialog allows you to edit a food item.
de: In diesem Dialog kannst Du ein Essen bearbeiten.

source: Be aware that 1 gram of carbs accounts for approximately 4 kcal, so the number carbs entered here multiplied by four may not exceed the total amount of energy in kcal.
de: Bitte beachte, dass 1 Gramm Kohlenhydrate ca. 4 kcal Energiegehalt hat, d.h. die hier eingegebene Menge Kohlenhydrate multipliziert mit vier darf die Gesamt-Energiemenge in kcal nicht überschreiten.

source: A good source for nutritional values (calories and carbs per 100g) is:
de: Eine gute Quelle für Nährwerte (Kalorien und Kohlenhydrate pro 100g) ist:

# Link-text-to-nutritional-values
source: Nutrition value
de: FDDB.info

# Link-URL-to-nutritional-values
source: https://www.nutritionvalue.org/
de: https://fddb.info/

source: Meal Details
de: Details

source: This view displays the details of your meal in a way that you can easily send a screenshot to e.g. your kid.
de: Diese Ansicht stellt die Details über Deine Mahlzeit so dar, dass sie leicht als Screenshot an, z.B., Dein Kind gesendet werden können.

source: With the + and - buttons, you can set the time interval until your meal will start, which is normally used for setting the time between injecting insulin and starting your meal.
de: Mit den + und - Knöpfen kannst Du die Zeit einstellen, bevor Deine Mahlzeit beginnt. In der Regel ist das der Spritz-Ess-Abstand.

source: Carbs from sugars are usually the fastest to be absorbed. You can set the parameters in the Absorption Scheme settings dialog.
de: Kohlenhydrate von Zucker werden in der Regel sofort absorbiert. Du kannst die Parameter im Absorptionsschema-Dialog anpassen.

source: Regular carbs are absorbed slower than sugars. You may as well modify the parameters in the Absorption Scheme settings dialog.
de: Reguläre Kohlenhydrate werden langsamer als Zucker verdaut. Du kannst die entsprechenden Parameter ebenfalls im Absorptionsschema-Dialog anpassen.

source: Extended carbs, aka. e-Carbs or Fake Carbs, do not stem from carbs, but from fat and proteins. That's why their absorption can take very long and starts late.
de: Verlängerte Kohlenhydrate stammen aus der Verdauung von Fett und Proteinen (und sind eigentlich keine Kohlenhydrate). Daher kann ihre Absorptionszeit spät starten und sehr lange andauern.

source: Clears your meal, i.e. removes all food items and resets the time period the meal will start in to zero.
de: Setzt Deine Mahlzeit zurück, d.h. alle Speisen werden entfernt und der Spritz-Ess-Abstand wird auf Null zurückgesetzt.

source: Starts the process of exporting the meal to Apple Health (for use in Loop). You will be able to review the details, so no actual export happens yet.
de: Tippe auf Exportieren, um den Export der Mahlzeit nach Apple Health (zur Verwendung in Loop) zu beginnen. Du kannst die Details noch überprüfen, d.h., es erfolgt noch kein tatsächlicher Export.

source: Lets you add and edit the dishes included in the meal.
de: Um die Speisen der Mahlzeit zu bearbeiten oder weitere hinzuzufügen, tippe auf Mehr hinzufügen.

source: Opens a view with all the details of the meal and its dishes.
de: Öffnet eine Ansicht mit allen Details der Mahlzeit und seiner Speisen.

source: You find your recipes on the recipe list. An EasyFPU recipe consists of a number of ingredients, which make up a final dish. Example: A cake (final dish) consists of flour, milk, sugar, eggs, etc. (its ingredients).
de: Deine Rezepte findest Du in der Rezeptliste. Ein EasyFPU-Rezept besteht aus einer Reihe von Zutaten, die eine fertige Speise ergeben. Beispiel: Ein Kuchen (fertige Speise) besteht aus Mehl, Milch, Zucker, Eiern usw. (seine Zutaten).

# Start creating a new recipe.
source: Creates a new recipe.
de: Beginnt ein neues Rezept.

# Filter your recipes by your favorites.
source: Filters your recipes by your favorites.
de: Filtert Deine Rezepte nach Lieblingsrezepten.

source: To edit, duplicate, share or delete a recipe, swipe left or right.
de: Um ein Rezept zu bearbeiten, zu duplizieren, zu teilen oder zu löschen, nach links oder rechts wischen.

source: Edit Absorption Scheme
de: Absorptionsschema

source: The absorption scheme defines, which absorption time is proposed for a given amount of FPUs. The pre-defined absorption scheme matches today‘s recommendations from nutrition science and is as follows:
de: Das Absorptionsschema legt fest, welche Absorptionszeit für eine gegebene Menge FPE vorgeschlagen wird. Das voreingestellte Absorptionsschema entspricht heutigen ernährungswissenschaftlichen Erkenntnissen und ist wie folgt:

source: 1 FPU (= 10g extended carbs): 3 hours absorption time
de: 1 FPE (= 10g verlängerte Kohlenhydrate): 3 Stunden Absorptionszeit

source: 2 FPUs (= 20g extended carbs): 4 hours absorption time
de: 2 FPE (= 20g verlängerte Kohlenhydrate): 4 Stunden Absorptionszeit

source: 3 FPUs (= 30g extended carbs): 5 hours absorption time
de: 3 FPE (= 30g verlängerte Kohlenhydrate): 5 Stunden Absorptionszeit

source: 4 FPUs (= 40g extended carbs): 6 hours absorption time
de: 4 FPE (= 40g verlängerte Kohlenhydrate): 6 Stunden Absorptionszeit

source: 6 FPUs (= 60g extended carbs) and more: 8 hours absorption time
de: 6 FPE (= 60g verlängerte Kohlenhydrate) und mehr: 8 Stunden Absorptionszeit

source: The calculation logic is as follows:
de: Die Kalkulationslogik ist wie folgt:

source: Step 1: Calculation of the total calories, e.g. for 72g Chicken McNuggets (249 kcal per 100g): 72g * 249 kcal / 100g = 179 kcal
de: Schritt 1: Berechnung der Gesamtkalorien, z.B. für 72g Chicken McNuggets (249 kcal pro 100g): 72g * 249 kcal / 100g = 179 kcal

source: Step 2: Calculation of the calories caused by carbs (4 kcal per 1g of carbs), e.g. for 72g Chicken McNuggets (17g carbs per 100g): 72g * 17gCarbs / 100g * 4 kcal/gCarbs = 49 kcal
de: Schritt 2: Berechnung der Kalorien durch Kohlenhydrate (4 kcal pro 1g Kohlenhydrate), z.B. für 72g Chicken McNuggets (17g Kohlenhydrate pro 100g): 72g * 17gCarbs / 100g * 4 kcal/gCarbs = 49 kcal

source: Step 3: Substract the calories caused by carbs from the total calories, e.g.: 179 kcal - 49 kcal = 130 kcal
de: Schritt 3: Subtraktion der Kalorien aus Kohlenhydraten von den Gesamtkalorien, z.B.: 179 kcal - 49 kcal = 130 kcal

source: Step 4: As 100 kcal represent 1 FPU, this results in 1.3 FPUs respectively 13g of extended carbs.
de: Schritt 4: Da 100 kcal einer 1 FPE entsprechen, führt das zu 1,3 FPE bzw. 13g verlängerten Kohlenhydraten.

source: Step 5: The FPUs will be rounded, in our example to 1 FPU, and the absorption time will be looked up, in our example 3 hours.
de: Schritt 5: Die FPE werden gerundet (in unserem Beispiel auf 1 FPE) und die Absorptionszeit im Absorptionsschema nachgeschlagen (in unserem Beispiel 3 Stunden).

source: Editing the absorption scheme is only recommended for advanced users, who have experience in FPUs / absorption time. The absorption scheme can always be reset to the pre-defined scheme above.
de: Es wird nur erfahrenen Benutzern mit guter Kenntnis der diabetologischen Konsequenzen empfohlen, das Absorptionsschema anzupassen. Es kann jedoch jederzeit auf das voreingestellte Schema zurückgesetzt werden.

source: Furthermore you may modify the delay for the extended carbs, i.e. the time your body will need to digest your meal before the extended carbs from fat and protein start to be effective. Recommendation and default is 90 minutes.
de: Du kannst außerdem die Verzögerung der verlängerten Kohlenhydrate einstellen, d.h. die Zeit, die Dein Körper für die Verdauung benötigt, bevor die Kohlenhydrate aus Fett und Protein wirksam werden. Empfehlung und Voreinstellung ist 90 Minuten.

source: Finally, the interval parameter will be used to determine the time interval between each extended carb entry in Apple Health. Default is 10 minutes. Please see the help pages of the meal export view for further details.
de: Der Intervall-Parameter legt den Zeitraum zwischen den einzelnen Kohlenhydrat-Einträgen beim Export nach Apple Health fest. Voreinstellung ist 10 Minuten. Mehr dazu auf der Hilfe-Seite der Export-Ansicht.

# Food Item Composer
source: Recipe Editor
de: Rezept-Editor

source: This view summarizes your recipe. It shows the selected ingredients and lets you edit the following details:
de: Diese Ansicht fasst Dein Rezept zusammen und lässt sie folgende Eingaben vervollständigen:

# - The name of the composed product / recipe
source: - The name of the finished dish / recipe
de: - Den Namen der fertigen Speise bzw. Rezepts

# - The total weight of the final product
source: - The total weight of the finished dish
de: - Das Gesamtgewicht der fertigen Speise

source: - Whether or not the recipe is a favorite
de: - Lieblingsessen

source: - The number of portions
de: - Anzahl der Portionen

# Lets you add and edit the ingredients included in the dish.
source: Lets you add and edit the ingredients included in the recipe.
de: Durch Tippen auf Mehr hinzufügen kannst Du Zutaten bearbeiten oder weitere hinzufügen.

source: Saves your recipe to the recipe list and creates a new dish in the list of dishes.
de: Bei Tippen auf Speichern wird Dein Rezept in der Rezeptliste gespeichert und eine neue Speise in der Liste der Speisen erstellt.

source: You may export nutritional data to Apple Health in this view. Choose the data to be exported using the toggles.
de: Du kannst Nährwerte nach Apple Health exportieren. Wähle die entsprechenden Daten mit den Auswahlknöpfen aus.

source: The following data are available for export:
de: Folgende Daten stehen zum Export zur Verfügung:

source: - Sugars (if set in the Absorption Scheme editor)
de: - Kohlenhydrate aus Zucker (falls im Absorptionsschema-Dialog ausgewählt)

source: - Regular Carbs
de: - Reguläre Kohlenhydrate

source: - Extended Carbs
de: - Verlängerte Kohlenhydrate

source: - Total Meal Calories
de: - Kalorien der Gesamtmahlzeit

source: Important information for Loop users:
de: Wichtige Hinweise für Loop-Nutzer:

source: If you want Loop to consider these carbs, make sure that it is allowed to read carbs from Apple Health in the Health settings.
de: Wenn Loop diese Kohlenhydrate in seiner Berechnung berücksichtigen soll, stelle in den Einstellungen von Health sicher, dass Loop Kohlenhydrat-Daten aus Apple Health lesen darf

source: How are the Extended Carbs exported?
de: Wie werden die verlängerten Kohlenhydrate (e-Carbs) exportiert?

source: - The number of e-carb entries is determined by dividing the absorption time (e.g. 5 hours) by the interval (e.g. 10 minutes, see Absorption Scheme view), i.e. 5 hours / 10 minutes = 30
de: - Die Anzahl der e-Carbs-Einträge wird berechnet, indem die Absorptionszeit (z.B. 5 Stunden) durch die Intervallzeit (z.B. 10 Minuten, siehe Absorptionsschema-Ansicht) geteilt wird, also: 5 Stunden / 10 Minuten = 30

source: - The e-carbs amount per entry is determined by dividing the meal's e-carbs (e.g. 60 g) by the number of e-carb entries (e.g. 30), i.e. 60 g / 30 = 2 g
de: - Die e-Carbs-Menge pro Eintrag wird berechnet, die e-Carbs der Mahlzeit (z.B. 60 g) durch die Anzahl der Einträge (z.B. 30) geteilt wird, also: 60 g / 30 = 2 g

source: - For each of these e-carb entries, an Apple Health record is created and exported to Apple Health with, starting at the current time plus the configured delay (default: 90 minutes; see Absorption Scheme view) and with the configured time interval (default: 10 minutes; see Absorption Scheme view)
de: - Für jeden dieser Einträge wird ein Apple Health Datensatz generiert und nach Apple Health exportiert, beginnend mit der aktuellen Zeit plus die eingestellte Verzögerung (Voreinstellung: 90 Minuten; siehe Absorptionsschema-Ansicht) und mit den eingestellten Zeit-Intervall (Voreinstellung: 10 Minuten; siehe Absorptionsschema-Ansicht)

source: Similar calculations are done for sugars and regular carbs.
de: Analoge Berechnungen werden für Zucker- und reguläre Kohlenhydrate durchgeführt.

# The graph visualizes how these data are exported.
source: The graph visualizes how these data are exported. You can zoom in and out to see more or less details.
de: Der Graph zeigt an, wie diese Daten exportiert werden. Du kannst hinein- und herauszoomen, um mehr oder weniger Details zu sehen.

source: Before the actual export happens, you will be prompted for authentication for safety reasons, as the exported data may influence the insulin amount delivered by your Loop system.
de: Vor dem eigentlichen Export wirst Du aus Sicherheitsgründen um Authentifizierung gebeten, da der Export von Kohlenhydraten Einfluss auf die abgegebene Insulinmenge Deines Insulinpumpensystems haben kann, wenn Du z.B. Loop verwendest.
